app/views/services/display.html.erb


<% services = Service.limit(9) %>
---
SELECT `services`.* FROM `services` LIMIT 9

	<p><%= link_to("#{service.name}", "../sample_apps/#{service.url_path}") %></p>
	<p onclick="addCount()"><% link_to("#{service.name}", "#{HitCount.create(:service_id => "#{service.id}")}") %></p>
---
INSERT INTO `hit_counts` (`service_id`, `created_at`, `updated_at`) VALUES (1, '2014-05-17 08:29:01', '2014-05-17 08:29:01')


<% if Service.count > 9 %>
---
SELECT COUNT(*) FROM `services`