app/views/services/next.html.erb

SELECT `services`.* FROM `services`
---

<% services = Service.all %>

SELECT COUNT(*) FROM `services`
---

<% if Service.count > 18 %>